## Major topic covered are Join, Combine, and Reshape.

## Hierarchical Indexing

In [1]:
## load Libraies 

import numpy as np
import pandas as pd

In [4]:
data = pd.Series(np.random.uniform(size=9),
                 index = [["a", "a", "a", "b", "b", "c", "c", "d", "d"],
                          [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.638882
   2    0.008294
   3    0.836631
b  1    0.695784
   3    0.706090
c  1    0.201649
   2    0.588532
d  2    0.810001
   3    0.803249
dtype: float64

In [5]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [8]:
data['b']

1    0.695784
3    0.706090
dtype: float64

In [9]:
data['b'][1]

0.6957843031196638

In [10]:
data["b":"c"]

b  1    0.695784
   3    0.706090
c  1    0.201649
   2    0.588532
dtype: float64

In [19]:
data.loc[["b","c"]]

b  1    0.695784
   3    0.706090
c  1    0.201649
   2    0.588532
dtype: float64

In [20]:
# Unstack

data.unstack()

          1         2         3
a  0.638882  0.008294  0.836631
b  0.695784       NaN  0.706090
c  0.201649  0.588532       NaN
d       NaN  0.810001  0.803249

In [21]:
data.unstack().stack()

a  1    0.638882
   2    0.008294
   3    0.836631
b  1    0.695784
   3    0.706090
c  1    0.201649
   2    0.588532
d  2    0.810001
   3    0.803249
dtype: float64

In [22]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
 ....: index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
 ....: columns=[["Ohio", "Ohio", "Colorado"],
 ....: ["Green", "Red", "Green"]])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [23]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [25]:
frame.index.names = ["key1","key2"]

In [26]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [27]:
# check levels 

frame.index.levels

FrozenList([['a', 'b'], [1, 2]])

In [48]:
frame.columns.names = ["state", "color"]

### Reording and sorting levels

In [49]:
frame.swaplevel(0,1)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [50]:
frame.swaplevel("key1","key2")

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [51]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [52]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [53]:
frame.groupby(level="key2").sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [54]:
frame.groupby(level="color", axis="columns").sum()

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Indexing with a DataFrame's columns

In [56]:
frame = pd.DataFrame({"a": range(7), "b": range(7, 0, -1),
 ....: "c": ["one", "one", "one", "two", "two", "two", "two"],
 ....: "d": [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [57]:
# set index will create new DF with column as index
frame2 = frame.set_index(["c","d"]) 
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [58]:
frame.set_index(["c","d"], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [60]:
frame2.reset_index() # opoosite of set index.

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1